app/controllers/pages_controller.rb

  	def show
  		@gossips = Gossip.find(params[:id])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]